fa-xbrl/src/Catalogs/velpo_FieldQueryLinks/velpo_FieldQueryLinks.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>velpo_FieldQueryLinks</name>
  <owners>ChartOfCharacteristicTypes.velpo_SourceQueryComponents</owners>
  <attributes>
    <name>LinkType</name>
    <type>
      <types>EnumRef.velpo_FieldQueryLinkTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>Axis</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.velpo_HypercubeAxes</types>
    </type>
  </attributes>
  <attributes>
    <name>Concept</name>
    <type>
      <types>ChartOfAccountsRef.velpo_Reporting</types>
    </type>
  </attributes>
  <attributes>
    <name>UseSourceValue</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Result</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.velpo_SourceQueryComponents</types>
    </type>
  </attributes>
  <attributes>
    <name>DataType</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.velpo_ValueDataTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>UseFieldLink</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>FieldLink</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.velpo_SourceQueryComponents</types>
    </type>
  </attributes>
  <attributes>
    <name>UseTotals</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Unique</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>AxisSetNumber</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Unit</name>
    <type>
      <types>CatalogRef.velpo_Units</types>
    </type>
  </attributes>
  <attributes>
    <name>NegativeSign</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>UsePeriod</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>FieldPeriodStart</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.velpo_SourceQueryComponents</types>
    </type>
  </attributes>
  <attributes>
    <name>FieldPeriodEnd</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.velpo_SourceQueryComponents</types>
    </type>
  </attributes>
  <attributes>
    <name>Comments</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>AxisLinks</name>
    <attributes>
      <name>Otherwise</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>FieldValue</name>
      <type>
        <types>Characteristic.velpo_SourceQueryComponents</types>
      </type>
    </attributes>
    <attributes>
      <name>Axis</name>
      <type>
        <types>Characteristic.velpo_HypercubeAxes</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ConceptLinks</name>
    <attributes>
      <name>Otherwise</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>FieldValue</name>
      <type>
        <types>Characteristic.velpo_SourceQueryComponents</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.velpo_ValueDataTypes</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>FieldFilters</name>
    <attributes>
      <name>FilterType</name>
      <type>
        <types>EnumRef.velpo_FilterQueryTypes</types>
      </type>
    </attributes>
    <attributes>
      <name>Field</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.velpo_SourceQueryComponents</types>
      </type>
    </attributes>
    <attributes>
      <name>ComparisonType</name>
      <type>
        <types>EnumRef.velpo_ComparisonQueryTypes</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.velpo_SourceQueryComponents</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>UniqueFields</name>
    <attributes>
      <name>Field</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.velpo_SourceQueryComponents</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

fa-xbrl/src/Catalogs/velpo_FieldQueryLinks/Forms/LoadFromValueList/Module.bsl
&НаКлиенте
Процедура LoadList(Команда)

	vFilterType = ПредопределенноеЗначение("Перечисление.FilterQueryTypes.Or");
	ReturnArray = New Array;
	ValueArray = velpo_StringFunctionsClientServer.SplitStringIntoSubstringArray(ThisForm.ValueList, ",");
	For Each Value In ValueArray Do
		ReturnStructure = New Structure;
		ReturnStructure.Insert("FilterType", vFilterType); 
		ReturnStructure.Insert("Field", ThisForm.Field);
		ReturnStructure.Insert("ComparisonType", ThisForm.ComparisonType);
		ReturnStructure.Insert("Value", Value);
		ReturnArray.Add(ReturnStructure);
	EndDo;
	
	Notify("LoadFromValueList", ReturnArray);
	
КонецПроцедуры
